# language: fa
@feature
Feature: ثبت متقاضی — ارسال برای تأیید جهت ایجاد باجه
  ثبت اطلاعات متقاضیان

  Rule: ثبت اطلاعات متقاضیان توسط رئیس شعبه هر استان انجام میشود
    هر استان میتواند تعداد مختلفی شعبه و رئیس شعبه داشته باشد

  Rule: ثبت نتیجه آزمون متقاضیان توسط کارشناس اداره کل بانکداری خرد و امور باجه‌ها انجام میشود

  Scenario: 1- به‌عنوان کارشناس حوزه باجه‌ها می‌خواهم متقاضی ثبت کنم تا در پروسه تأیید متقاضی قرار بگیرد
    فرض کاربر در نقش کارشناس حوزه باجه ها قرار دارد
    و کاربر در صفحه ایجاد متقاضی قرار دارد
    وقتی کاربر دکمه "اضافه کردن" را کلیک می‌کند
    آنگاه به صفحه "اطلاعات شخص" منتقل می‌شود
    و کاربر فیلد های الزامی را تکمیل می کند
    وقتی کاربر دکمه "ذخیره" را کلیک می‌کند
    آنگاه اطلاعات متقاضی به کارشناس اداره کل جهت تعیین تکلیف نتیجه  آزمون ارسال میشود

    Examples:
      | نام فیلد | مقدار |
      | نام | احمد |
      | نام خانوادگی | رضایی |

  Scenario: 2- به‌عنوان کارشناس حوزه باجه ها، اگر اطلاعات اجباری را وارد نکنم، باید پیام خطا دریافت کنم تا نتوانم ادامه فرایند ثبت متقاضی را انجام دهم
    فرض کاربر در نقش کارشناس حوزه باجه ها قرار دارد
    و کاربر  در صفحه ثبت متقاضی قرار دارد
    وقتی کاربر بر روی دکمه اضافه کردن کلیک می کند
    آنگاه به صفحه "اطلاعات شخص" منتقل می‌شود
    وقتی کاربر فیلد های اجباری را تکمیل نمی کند
    و دکمه "ذخیره" را انتخاب می‌کند
    آنگاه پیام خطا نمایش داده می‌شود

    Examples:
      | نام فیلد | پیام خطا |
      | نام | فیلد نام الزامی است |
      | نام خانوادگی | فیلد نام خانوادگی الزامی است |

  Scenario: 3- به‌عنوان کارشناس اداره کل بانکداری خرد، می‌خواهم نتیجه آزمون «قبول شده» برای متقاضی ثبت شود، تا در لیست متقاضیان برای ثبت باجه قرار بگیرد
    فرض کاربر با نقش کارشناس اداره کل بانکداری خرد قرار دارد
    و در صفحه ثبت متقاضی قرار دارد
    وقتی کاربر دکمه "عملیات" را کلیک می‌کند
    آنگاه به صفحه "متقاضی" منتقل می‌شود
    وقتی کاربر فیلد های اجباری را تکمیل می کند
    و کبمو باکس نتیجه نهایی "قبول" را انتخاب کند
    وقتی کاربر دکمه "ذخیره" را انتخاب می‌کند
    آنگاه اطلاعات متقاضی در لیست متقاضی ها جهت استفاده در باجه ثبت باجه، ثبت میشود

    Examples:
      | نام فیلد | مقدار |
      | نتیجه نهایی | قبول |

  Scenario: 4- به‌عنوان کارشناس اداره کل بانکداری خرد، می‌خواهم نتیجه آزمون «رد شده» برای متقاضی ثبت شود، تا در لیست متقاضیان برای ثبت باجه قرار نگیرد
    فرض کاربر با نقش کارشناس اداره کل بانکداری خرد قرار دارد
    و در صفحه ثبت متقاضی قرار دارد
    وقتی کاربر دکمه "عملیات" را کلیک می‌کند
    آنگاه به صفحه "متقاضی" منتقل می‌شود
    وقتی کاربر فیلد های اجباری را تکمیل می کند
    و کبمو باکس نتیجه نهایی "رد" را انتخاب کند
    وقتی کاربر دکمه "ذخیره" را انتخاب می‌کند
    آنگاه پیام سند با موفقیت ذخیره شد نمایش داده میشود
    و نام متقاضی در لیست متقاضیان جهت ثبت باجه قرار نمیگیرد

    Examples:
      | نام فیلد | مقدار |
      | نتیجه نهایی | رد |

  Scenario: 5- به‌عنوان کارشناس اداره کل بانکداری خرد، می‌خواهم آزمونی برای متقاضی ثبت کنم تا بتوان در صورت ثبت نکردن فیلدهای اجباری خطا مورد نظر رویت گردد
    فرض کاربر در نقش کارشناس اداره کل بانکداری خرد قرار دارد
    و در صفحه "ثبت متقاضی" قرار دارد
    وقتی کاربر دکمه عملیات را کلیک می‌کند
    آنگاه به صفحه "متقاضی" منتقل می‌شود
    وقتی کاربر فیلد های اجباری را تکمیل نمی کند
    و دکمه "ذخیره" را انتخاب می‌کند
    آنگاه خطاهای مورد انتظار را نشان داده می شود 
    و از ذخیره فرم جلوگیری می شود

    Examples:
      | فیلد | مقدار |
      | نتیجه نهایی | رد |

