# language: fa
@feature @applicant_registration
وِیژگی: ثبت متقاضی — ارسال برای تأیید جهت ایجاد باجه
  ثبت اطلاعات متقاضیان

  قاعده: ثبت اطلاعات متقاضیان توسط رئیس شعبه هر استان انجام میشود
    هر استان میتواند تعداد مختلفی شعبه و رئیس شعبه داشته باشد

  قاعده: ثبت نتیجه آزمون متقاضیان توسط کارشناس اداره کل بانکداری خرد و امور باجه‌ها انجام میشود

  @positive @smoke @applicant_registration
  الگوی سناریو: 1- به‌عنوان کارشناس حوزه باجه‌ها می‌خواهم متقاضی ثبت کنم تا در پروسه تأیید متقاضی قرار بگیرد
    با فرض کاربر در نقش کارشناس حوزه باجه ها قرار دارد
    و کاربر در صفحه ثبت متقاضی قرار دارد
    هنگامی کاربر دکمه "اضافه کردن" را کلیک می‌کند
    آنگاه به صفحه "متقاضی" منتقل می‌شود
    و کاربر دکمه دوم "اضافه کردن" را کلیک می‌کند
    آنگاه به صفحه "اطلاعات شخص" منتقل می‌شود
    و کاربر فیلد های الزامی را تکمیل می کند
    هنگامی کاربر دکمه "ذخیره" را کلیک می‌کند
    آنگاه اطلاعات متقاضی به کارشناس اداره کل جهت تعیین تکلیف نتیجه آزمون ارسال میشود

    نمونه ها: اطلاعات شخص
      | نام | نام خانوادگی |
      | احمد | رضایی |
